---
kind: other
id: Properties.T:Autodesk.Revit.DB.ScheduleFieldId
source: html/1ba164bd-0afa-fde8-c5c8-c72f6da91634.htm
---
# ScheduleFieldId Properties

Provides the value of the ScheduleFieldId as an integer.